B35doc/English/online/elbug_C2/samples/cavityinfo/ElectricalBundle2.1.xml

<!--Important: use only API to modify this file !-->

<SOAP_ENV:Envelope xmlns:SOAP_ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ixf="http://www.ixfstd.org/std/ns/core/1.0" xmlns:tns="IXF_Schema.xsd" xsi:schemaLocation="IXF_Schema.xsd e:\tmp\IXF\ElectricalSchema.xsd" xmlns:NS1="CATIA/V5/Electrical/1.0" xmlns:NS2="http://www.ixfstd.org/std/ns/core/classBehaviors/links/1.0" xmlns:NS3="CATIA/V5/ElecFunctionalBehavior/1.0">
<SOAP_ENV:Body><ixf:object id = "Electrical Bundle2.1" xsi:type = "tns:Harness"><tns:Name>Electrical Bundle2.1</tns:Name>
</ixf:object>
<ixf:object id = "Signal-minusWire2.1" xsi:type = "tns:Wire"><tns:Name>Signal-minusWire2.1</tns:Name>
<NS1:Wire><NS1:Length>0.249521</NS1:Length>
<NS1:Color>Green</NS1:Color>
<NS1:LinearMass>0.256</NS1:LinearMass>
<NS1:OuterDiameter>0.0052</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>PN-AMP-3403B</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID214" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#Signal-minusWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID215" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_F.11Termination_plus"/>
<NS2:object2 href = "#Signal-minusWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID216" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#IR-1Term.1Termination1"/>
<NS2:object2 href = "#Signal-minusWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Signal-minusWire3.1" xsi:type = "tns:Wire"><tns:Name>Signal-minusWire3.1</tns:Name>
<NS1:Wire><NS1:Length>0.283181</NS1:Length>
<NS1:Color>Green</NS1:Color>
<NS1:LinearMass>0.256</NS1:LinearMass>
<NS1:OuterDiameter>0.0052</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>PN-AMP-3403B</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID217" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#Signal-minusWire3.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID218" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#IR-1Term.1Termination1"/>
<NS2:object2 href = "#Signal-minusWire3.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID219" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_MINUS"/>
<NS2:object2 href = "#Signal-minusWire3.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Signal-minusWire4.1" xsi:type = "tns:Wire"><tns:Name>Signal-minusWire4.1</tns:Name>
<NS1:Wire><NS1:Length>0.411127</NS1:Length>
<NS1:Color>Green</NS1:Color>
<NS1:LinearMass>0.256</NS1:LinearMass>
<NS1:OuterDiameter>0.0052</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>PN-AMP-3403B</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID220" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#Signal-minusWire4.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID221" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#IR-1Term.1Termination1"/>
<NS2:object2 href = "#Signal-minusWire4.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID222" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_MINUS"/>
<NS2:object2 href = "#Signal-minusWire4.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Signal-checkWire2.1" xsi:type = "tns:Wire"><tns:Name>Signal-checkWire2.1</tns:Name>
<NS1:Wire><NS1:Length>0.532702</NS1:Length>
<NS1:Color>blue</NS1:Color>
<NS1:SubType> </NS1:SubType>
<NS1:BendRadius>0.02</NS1:BendRadius>
<NS1:OuterDiameter>0.00250007</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>wire-2.5mm-blue</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID223" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#Signal-checkWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID224" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_F.11Termination_minus"/>
<NS2:object2 href = "#Signal-checkWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID225" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_CHECK"/>
<NS2:object2 href = "#Signal-checkWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "signal-plusWire4.1" xsi:type = "tns:Wire"><tns:Name>signal-plusWire4.1</tns:Name>
<NS1:Wire><NS1:Length>0.411127</NS1:Length>
<NS1:Color>yellow</NS1:Color>
<NS1:SubType> </NS1:SubType>
<NS1:BendRadius>0.02</NS1:BendRadius>
<NS1:OuterDiameter>0.002</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>wire-2mm-yellow</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID226" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#signal-plusWire4.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID227" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#IS-2Term.1Termination1"/>
<NS2:object2 href = "#signal-plusWire4.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID228" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_PLUS"/>
<NS2:object2 href = "#signal-plusWire4.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "signal-plusWire2.1" xsi:type = "tns:Wire"><tns:Name>signal-plusWire2.1</tns:Name>
<NS1:Wire><NS1:Length>0.249521</NS1:Length>
<NS1:Color>blue</NS1:Color>
<NS1:SubType> </NS1:SubType>
<NS1:BendRadius>0.02</NS1:BendRadius>
<NS1:OuterDiameter>0.00250007</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>wire-2.5mm-blue</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID229" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#signal-plusWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID230" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Connector_F.11Termination_check"/>
<NS2:object2 href = "#signal-plusWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID231" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#IS-2Term.1Termination1"/>
<NS2:object2 href = "#signal-plusWire2.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "signal-plusWire3.1" xsi:type = "tns:Wire"><tns:Name>signal-plusWire3.1</tns:Name>
<NS1:Wire><NS1:Length>0.283181</NS1:Length>
<NS1:Color>black</NS1:Color>
<NS1:SubType> </NS1:SubType>
<NS1:BendRadius>0.02</NS1:BendRadius>
<NS1:OuterDiameter>0.00250007</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>wire-2.5mm-black</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID232" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#Electrical Bundle2.1"/>
<NS2:object2 href = "#signal-plusWire3.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID233" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#IS-2Term.1Termination1"/>
<NS2:object2 href = "#signal-plusWire3.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID234" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_PLUS"/>
<NS2:object2 href = "#signal-plusWire3.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.11" xsi:type = "tns:Connector"><tns:Name>Connector_F.11</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_F</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID235" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.11Termination_minus"/>
<NS2:object2 href = "#Connector_F.11"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.11Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID236" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.11Termination_plus"/>
<NS2:object2 href = "#Connector_F.11"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.11Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID237" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.11Termination_check"/>
<NS2:object2 href = "#Connector_F.11"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.11Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "IR-1Term.1" xsi:type = "tns:Splice"><tns:Name>IR-1Term.1</tns:Name>
<NS1:Splice><NS1:Subtype> </NS1:Subtype>
</NS1:Splice>
<NS1:Product><NS1:PartNumber>IR-1Term</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID238" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#IR-1Term.1Termination1"/>
<NS2:object2 href = "#IR-1Term.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "IR-1Term.1Termination1" xsi:type = "tns:Pin"><tns:Name>Termination1</tns:Name>
</ixf:object>
<ixf:object id = "Connector_M.11" xsi:type = "tns:Connector"><tns:Name>Connector_M.11</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_M</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID239" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_MINUS"/>
<NS2:object2 href = "#Connector_M.11"/>
</NS2:link>
</ixf:object>
<ixf:object id = "POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_MINUS" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID240" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_PLUS"/>
<NS2:object2 href = "#Connector_M.11"/>
</NS2:link>
</ixf:object>
<ixf:object id = "POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_PLUS" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID241" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_CHECK"/>
<NS2:object2 href = "#Connector_M.11"/>
</NS2:link>
</ixf:object>
<ixf:object id = "POWERSUPPLY-BATTERY1_CONNECTOR-TERMINATION_CHECK" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "Connector_M.2" xsi:type = "tns:Connector"><tns:Name>Connector_M.2</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_M</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID242" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_MINUS"/>
<NS2:object2 href = "#Connector_M.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_MINUS" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID243" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_PLUS"/>
<NS2:object2 href = "#Connector_M.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_PLUS" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID244" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_CHECK"/>
<NS2:object2 href = "#Connector_M.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "POWERSUPPLY-BATTERY2_CONNECTOR-TERMINATION_CHECK" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "IS-2Term.1" xsi:type = "tns:Splice"><tns:Name>IS-2Term.1</tns:Name>
<NS1:Splice/>
<NS1:Product><NS1:PartNumber>IS-2Term</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID245" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#IS-2Term.1Termination1"/>
<NS2:object2 href = "#IS-2Term.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "IS-2Term.1Termination1" xsi:type = "tns:Pin"><tns:Name>Termination1</tns:Name>
</ixf:object>
<ixf:object id = "UID246" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#IS-2Term.1Termination2"/>
<NS2:object2 href = "#IS-2Term.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "IS-2Term.1Termination2" xsi:type = "tns:Pin"><tns:Name>Termination2</tns:Name>
</ixf:object>
<ixf:object id = "Battery 6Volts.2" xsi:type = "tns:Equipment">
  <tns:Name>Battery 6Volts.2</tns:Name>
  <NS3:Function>
    <NS3:System_Type>ATA33</NS3:System_Type>
    <NS3:Description>Power supply</NS3:Description>
    <NS3:Localisation>Place into the available cavity in session</NS3:Localisation>
  </NS3:Function>
  <NS1:Product>
    <NS1:PartNumber>Battery 6Volts</NS1:PartNumber>
  </NS1:Product>
</ixf:object>
<ixf:object id = "UID247" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1"/>
<NS2:object2 href = "#Battery 6Volts.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1" xsi:type = "tns:Connector"><tns:Name>Cavity</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_F</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID248" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1Termination_minus"/>
<NS2:object2 href = "#Connector_F.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID249" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1Termination_plus"/>
<NS2:object2 href = "#Connector_F.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID250" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.1Termination_check"/>
<NS2:object2 href = "#Connector_F.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.1Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "Battery 6Volts.1" xsi:type = "tns:Equipment"><tns:Name>Battery 6Volts.1</tns:Name>
<NS1:Product><NS1:PartNumber>Battery 6Volts</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID251" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2"/>
<NS2:object2 href = "#Battery 6Volts.1"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2" xsi:type = "tns:Connector"><tns:Name>Cavity</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_F</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID252" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2Termination_minus"/>
<NS2:object2 href = "#Connector_F.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2Termination_minus" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID253" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2Termination_plus"/>
<NS2:object2 href = "#Connector_F.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2Termination_plus" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID254" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Connector_F.2Termination_check"/>
<NS2:object2 href = "#Connector_F.2"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Connector_F.2Termination_check" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
</SOAP_ENV:Body>
</SOAP_ENV:Envelope>


